Revit 2026 API

# FileDialog Methods

---

The FileDialog type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSelectedModelPath | Returns the selected file path chosen by the user. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidFilterString | Determines if the input string is acceptable as input for a FileDialog filter string. |
|  | Show | Shows the dialog using the stored settings. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

FileDialog Class

Autodesk.Revit.UI Namespace